{
	"1_overlord": {
		"label":"",
		"people": [
			{"name": "Joseph Austerweil",
			"title": "Assistant Professor",
			"image": "/img/people/joe.jpg",
			"blurb": "As a computational cognitive psychologist, my research program explores questions at the intersection of perception and higher-level cognition. I use recent advances in statistics and computer science to formulate ideal learner models to see how they solve these problems and then test the model predictions using traditional behavioral experimentation. Ideal learner models help us understand the knowledge people use to solve problems because such knowledge must be made explicit for the ideal learner model to successfully produce human behavior. This method yields novel machine learning methods and leads to the discovery of new psychological principles."}
		]
	},

	"2_grads_postdocs": {
		"label":"Postdocs and Graduate Students",
		"people": [
			{"name": "Nolan Conaway",
			"title": "Postdoctoral Researcher",
			"image": "/img/people/nolanconaway.jpg",
			"blurb": "Nolan studies categorization and representation learning using behavioral experiments guided by computational modeling. He received his PhD from SUNY Binghamton working with Kenneth Kurtz.",
			"website": "https://nolanbconaway.github.io/"},
	
			{"name": "Jeff Zemla",
			"title": "Postdoctoral Researcher",
			"blurb": "Jeff studies semantic memory and Alzheimer's Disease. He received his PhD from Rice University working with Mike Byrne.",
			"website":"http://chil.rice.edu/jzemla/"},
	
			{"name": "Mark Ho",
			"title": "Graduate Student ",
			"image": "/img/people/markho.png",
			"website": "http://www.markkho.com/",
			"blurb": "Mark studies social learning using computational and behavioral methods. Currently, he is focused on teaching with and learning from reward and punishment."}
			]
		},

	"3_affiliates": {
		"label":"Affiliates",
		"people": [
			{"name": "Jie Ren",
			"title": "Brown University and McGovern Institute for Brain Research, and Beijing Normal University",
			"image": "/img/people/jieren.jpg",
			"website": "https://sites.google.com/a/brown.edu/jie-ren/",
			"blurb": "​Jie's​ research is concerned with the biology and neurology of infant speech ​learning​. The research methods used in ​her​ research include behavioral measures of infant speech perception, functional neuroimaging (fNIRS) and computational modeling with ​machine-learning techniques."},

			{"name": "Boyoung Kim",
			"title": "Graduate Student at Brown University",
			"blurb": "Boyoung collaborates on modeling how people learn social norms.."},
	
			{"name": "Babak Hemmatian",
			"title": "Graduate Student at Brown University",
			"blurb": "I am an Iranian first year Ph.D. student of cognitive science, with a background in psychology, but a new-found love for computational modeling. I am most interested in integrating the computational models offered for different kinds of reasoning (inductive, causal, deductive, etc.), offering new such models (with an emphasis on causal reasoning) and comparing the proposals with regards to how well they capture the qualitative and quantitative aspects of human reasoning."}
		]
	},

	"4_alumni": {
		"label":"Alumni",
		"people": [
			{"name": "Ting Qian",
			"title": "Former Postdoctoral Scholar",
			"blurb": "Ting is now a data scientist at the Children's Hospital of Philadelphia."},
	
			{"name": "Yoed Kenett",
			"title": "Former Postdoctoral Scholar",
			"image": "/img/people/yoed_cropSmall.jpg",
			"blurb": "Yoed is now a postdoctoral scholar with Sharon Thompson-Schill at University of Pennsylvania."},
	
			{"name": "Mowafak Allaham",
			"title": "Former Post-Undergrad Research Assistant",
			"image": "/img/people/mowafak_cropSmall.jpg",
			"blurb": "Mowafak is now a graduate student in Psychology at University of Illinois-Chicago. He works with Sylvia Morelli."}
	
		]
	}
}